---
kind: type
id: T:Autodesk.Revit.DB.VertexIndexPairArray
source: html/ebf9396b-0cd1-2510-3957-80cd871a9db7.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray

An array that contains VertexIndex pairs.

## Syntax (C#)
```csharp
public class VertexIndexPairArray : APIObject,
	IEnumerable
```